[
  {
    "id": "9e31d84a-d8bb-43ba-acbe-3acc39df1936",
    "document_id": "doc_68",
    "content": "OpenSim Utilities Share Follow Project Follow publicly Follow privately Unfollow See followers (9) List Map More info 248 About Project summary Project statistics Project Activity Plots Geography of Use Team members About Project summary Project statistics Project Activity Plots Geography of Use Team members The purpose of this umbrella project is to provide a central repository of user-contributed OpenSim utilities and extensions. Download Latest Releases External Loads File Script: generateExternalLoadsFile.zip matlab_preprocessing: Matlab.zip License: Neuromusculoskeletal Builder This collection is no longer being maintained through this project. To find OpenSim utilities, you now have two options: 1) Visit the summary table on the OpenSim documentation pages ( http://simtk-confluence.stanford.edu:8080/display/OpenSim/Tools+for+Preparing+Motion+Data ) 2) Conduct a search on SimTK. Click here ( https://simtk.org/search/search.php?srch=opensim&type_of_search=soft ) and then narrow your search to \"Scripts, Plug-Ins, and Other Utilities\" by checking the box on the left. ------------------------------------------ A repository of tools written by members of the OpenSim community to support their usage of the software. Please respect your fellow OpenSim Users. In using these utilities we ask that you respect the hard work of your fellow researchers by citing their work appropriately. When you go to the Download section you will be directed to individual project pages for each model which contain all of the files and documentation. Please carefully review the publications and cite the references in your future papers, presentations, grant applications, etc. Have a utility to contribute? Do you have a utility which you would like to make available through this library? Providing others with access to your tools and utiities can stimulate future studies, provide a foundation for young researchers, and maximize the impact of your work. It’s easy to set up a project page to post your work. This will allow you to track who is using your utilities and be in contact with them. Please consider contributing! If you would like to have your project included on this site, please contact Jennifer Hicks, listed as one of the Project Leads. No guarantees about quality, correctness or support are provided by the SimTK team or OpenSim team. Use at your own risk. To find out more about the OpenSim project, please visit http://opensim.stanford.edu 9 followers Last updated Oct 11, 2017 Project Statistics Jennifer Hicks Ayman Habib People also viewed OpenSim Utilities and Beta Releases SCONE: Open Source Software for Predictive... OpenSim Motion and Simulation Data Dynamic Simulation of Movement Based on OpenSim and... Lee-Son's Toolbox: a Toolbox that Converts VICON... Neuromusculoskeletal Modeling (NMSM) Pipeline C3D Extraction Toolbox OpenSIM users group: University of Delaware See all STO / TRC / MOT files plotter Platform for Dynamic Simulation and Control of... A Visualization Tool for OpenSim Tim's OpenSim Utilities C3D Extraction Toolbox GUI Real-time OpenSim extension Marker registration method informed by anatomical... SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility",
    "metadata": {
      "source": "https://simtk.org/projects/opensim-utils",
      "title": "SimTK: OpenSim Utilities: Project Home",
      "section": "",
      "hierarchy": [
        "projects",
        "opensim-utils"
      ],
      "content_type": "reference",
      "position": 0,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  },
  {
    "id": "4c012618-a4ec-42fb-974f-571fd2b01e29",
    "document_id": "doc_68",
    "content": "a Toolbox that Converts VICON... Neuromusculoskeletal Modeling (NMSM) Pipeline C3D Extraction Toolbox OpenSIM users group: University of Delaware See all STO / TRC / MOT files plotter Platform for Dynamic Simulation and Control of... A Visualization Tool for OpenSim Tim's OpenSim Utilities C3D Extraction Toolbox GUI Real-time OpenSim extension Marker registration method informed by anatomical... SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
    "metadata": {
      "source": "https://simtk.org/projects/opensim-utils",
      "title": "SimTK: OpenSim Utilities: Project Home",
      "section": "",
      "hierarchy": [
        "projects",
        "opensim-utils"
      ],
      "content_type": "reference",
      "position": 1,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  }
]