[
  {
    "id": "09c9ee73-d97d-4049-b9ce-8ea9dc7fd508",
    "document_id": "doc_94",
    "content": "Dynamic Simulation of Movement Based on OpenSim and MATLAB®/Simulink® Share 470 This is a private project. You must be a member to view its contents. This project overcomes neuromusculoskeletal systems limitations of MATLAB®/Simulink® and robust design & control limitations of OpenSim through an interface between these two software packages that combines relevant strengths of each individual package. Numerical simulations are playing an increasingly important role in solving complex engineering problems, and have the potential to revolutionize medical decision making and treatment design. Musculoskeletal diseases cost the United States economy an estimated $849 billion a year (equal to 7.7% of the gross domestic product) and place great demands on the healthcare system. This research area could greatly benefit from computational tools that offer greater understanding of neuromuscular biomechanics, and predictive capabilities for optimal surgical and rehabilitation treatment planning. The MATLAB®/Simulink® package is the world’s leading mathematical computing software for engineers and scientists in industry, government, and education. Although Simulink® extends MATLAB® with a graphical environment for rapid design, control, and simulation of complex dynamic systems, this powerful package has limited resources for simulations of neuromusculoskeletal systems. On the contrary, OpenSim is a popular open-source platform for modeling, simulating, and analyzing neuromusculoskeletal systems, but it is lacks the robust design and control tools of Simulink®. This project is an interface between OpenSim and MATLAB®/Simulink® that combines relevant strengths (e.g., neuromusculoskeletal dynamics, rapid model-based design, control systems, and numerical simulation) of each individual software package. The foundation of this interface is a MATLAB® S-function (system-function) based on an OpenSim model as a Simulink® block written in C++ and compiled as a MEX-file using the MATLAB® mex utility. Misagh Mansouri Jeff Reinbolt People also viewed Platform for Dynamic Simulation and Control of... EMG-informed Computed Muscle Control for Dynamic... Batch OpenSim Processing Scripts (BOPS) OpenSim Simulations Library OpenSim Motion and Simulation Data Sam's Simulations Neuromusculoskeletal Modeling (NMSM) Pipeline How much muscle strength is required to walk in... See all Convert .c3d and .csv files to OpenSim files... Dynamic Arm Simulator Upper and Lower Body Model A Visualization Tool for OpenSim Tim's OpenSim Utilities London Lower Limb Model Marker registration method informed by anatomical... SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
    "metadata": {
      "source": "https://simtk.org/projects/opensim_matlab/",
      "title": "SimTK: Dynamic Simulation of Movement\r\nBased on OpenSim and MATLAB®/Simulink®: Project Home",
      "section": "",
      "hierarchy": [
        "projects",
        "opensim_matlab"
      ],
      "content_type": "reference",
      "position": 0,
      "tags": [
        "reference",
        "simulation",
        "intermediate"
      ]
    }
  }
]