[
  {
    "id": "cd730315-51d7-4962-bf00-e1e513034277",
    "document_id": "doc_65",
    "content": "Ajay Seth Delft University of Technology Biomechatronics & Human-Machine Control Personal website Contact Interests As the OpenSim software architect, I am interested in the development of tools for musculoskeletal modeling, control and simulation. Other Interests: Human performance. Contact modeling. Posture and balance. Member since Mar 15, 2007 Member of 52 projects Total forum posts: 136 Last forum post: May 30, 2019 Projects Ajay Seth is a member of the following projects: 2017 Fall OpenSim Virtual Workshop 2018 Fall OpenSim Virtual Workshop An OpenSim plugin to minimize joint reaction forces and... Are subject-specific musculoskeletal... Chand's Simulations Drop Landing Model Easy-to-use interactive musculoskeletal... Flexing Computational Muscle: Modeling... See all Marker registration method informed by anatomical... May Liu's Walking Simulations ME/BIOE 485 (Modeling and Simulation of Human... Model of the Scapulothoracic Joint Multiple Speed Walking Simulations Muscle-actuated Simulation of Human Running OpenSense OpenSense: Validation of IMU-based estimates... OpenSim OpenSim 3D World Objects Library OpenSim Advanced User and Developer Workshop, August... OpenSim Advanced User and Developer Workshop, March... OpenSim Advanced User and Developer Workshop, March... OpenSim Advanced Users Workshop, April 28-30, 2010 OpenSim Advanced Users Workshop, August 12-14, 2009 OpenSim and NMS Physiome Workshop OpenSim Creator OpenSim Developer Jamboree - July 12-14, 2010 OpenSim Developer's Jamboree 2008 OpenSim Developers Jamboree - October 28-30, 2009 OpenSim Developer's Jamboree | Winter 2009 OpenSim for the Warrior Web OpenSim Soccer Ball Kicking Example OpenSim Utilities Plantarflexor personalisation with group-specific... Platform for Dynamic Simulation and Control of... Predicting changes in gait mechanics over a range of AFO... Predictive Simulation of Loaded and Inclined... Predictive Simulation of Standing Long Jumps... QSim: C++/Qt Prototype GUI for easy-to-use... Quantifying uncertainty in inverse analyses... Sensory Components for Simulating Postural Feedback... Simbios Dissemination Simbody: Multibody Physics API SimTK Planning Project Simulated muscle fiber lengths and velocities during... Simulating Ideal Assistive Devices to Reduce the... Simulation Labs utilizing OpenSim software Simulations of Crouch Gait Spasticity model in OpenSim Stretch Reflexes in OpenSim The Musculoskeletal Modeler's Kitchen Thoracoscapular muscle contributions to... SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
    "metadata": {
      "source": "https://simtk.org/users/aseth",
      "title": "SimTK: Ajay Seth",
      "section": "",
      "hierarchy": [
        "users",
        "aseth"
      ],
      "content_type": "reference",
      "position": 0,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  }
]