[
  {
    "id": "01fc425f-39b2-4e59-af21-63d5724d9eef",
    "document_id": "doc_16",
    "content": "Statistical Analysis Statistics help make sense of the vast amount of data generated by today’s biological experiments, computational simulations, and clinical and diagnostic information. Featured projects Recently updated projects total projects 35 projects with downloads Search projects in this category News The Reference Model for COVID-19 - The First Multi-Scale Ensemble Disease Model The Reference Model for Disease Progression Jun 6, 2021 Dog model A three-dimensional musculoskeletal model of the dog May 31, 2021 The Reference Model now models COVID-19 The Reference Model for Disease Progression Jul 31, 2020 Publications The Neuromusculoskeletal Modeling Pipeline: MATLAB-based Model Personalization and Treatment Optimization Functionality for OpenSim Denton AN & Umberger BR. (2023). Computational performance of musculoskeletal simulation in OpenSim Moco using parallel computing. International Journal for Numerical Methods in Biomedical Engineering, e3777. Three Dimensional Lower Extremity Musculoskeletal Geometry of the Visible Human Female and Male Discussion Re: MTP Error: parseMuscleAnalysisCoordinates Mismatch Error Neuromusculoskeletal Modeling Pipeline Mar 24, 2025 Re: MTP Error: Undefined (Inf) Values at Initial Point Neuromusculoskeletal Modeling Pipeline Mar 13, 2025 Re: rotation and validation ACL Reconstruction Decision Support Through Personalized Simulation of the Lachm Dec 16, 2024 SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
    "metadata": {
      "source": "https://simtk.org/category/category.php?cat=416&sort=date&page=0&srch=&",
      "title": "SimTK: Project category",
      "section": "",
      "hierarchy": [
        "category",
        "category.php"
      ],
      "content_type": "reference",
      "position": 0,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  }
]