[
  {
    "id": "028fd733-5ab2-4fad-9737-67bb96340d89",
    "document_id": "doc_63",
    "content": "Ayman Habib Stanford University Neuromuscular Biomechanics Lab Contact Interests Musculoskeletal modeling and simulation. Biomechanics. Control. Other Interests: Modeling and simulation. Modular GUI design. Member since Apr 1, 2005 Member of 49 projects Total forum posts: 2255 Last forum post: Feb 6, 2025 Projects Ayman Habib is a member of the following projects: Ayman s Private Project Chand's Simulations Easy-to-use interactive musculoskeletal... Java wrap simbody LAPACK linear algebra library (with BLAS) Matlab-Opensim Interfaces May Liu's Walking Simulations ME/BIOE 485 (Modeling and Simulation of Human... See all Myosin Resources and Communication Neuromuscular Models Library OpenSense OpenSense: Validation of IMU-based estimates... OpenSim OpenSim 3D World Objects Library OpenSim Advanced User and Developer Workshop, August... OpenSim Advanced User and Developer Workshop, March... OpenSim Advanced User and Developer Workshop, March... OpenSim Advanced Users Workshop, April 28-30, 2010 OpenSim Advanced Users Workshop, August 12-14, 2009 OpenSim and NMS Physiome Workshop OpenSim Developer Jamboree - July 12-14, 2010 OpenSim Developer's Jamboree 2008 OpenSim Developers Jamboree - October 28-30, 2009 OpenSim Developer's Jamboree | Winter 2009 OpenSim for the Warrior Web ＯｐｅｎＳｉｍＣｏｌａｂ (OpenSim in Google Colab) OpenSim Science Advisors OpenSim Soccer Ball Kicking Example OpenSim Utilities Predictive Simulation of Standing Long Jumps... QSim: C++/Qt Prototype GUI for easy-to-use... Simbios Dissemination Simbody: Multibody Physics API SimTK Core Toolset (obsolete project) SimTK Framework Modeling Layer PROTOTYPE SimTK Planning Project SimTK Resources Project Simulation Labs utilizing OpenSim software Spasticity model in OpenSim SUNDIALS Suite of nonlinear differential... ToRNADo UW-Madison Workflow for Gait VTK Binaries for the SimTK Core xerces-c Followed projects Ayman Habib is following the project below: 2017 Fall OpenSim Virtual Workshop SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
    "metadata": {
      "source": "https://simtk.org/users/aymanh",
      "title": "SimTK: Ayman Habib",
      "section": "",
      "hierarchy": [
        "users",
        "aymanh"
      ],
      "content_type": "reference",
      "position": 0,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  }
]