[
  {
    "id": "b2798312-6a0f-404d-aecc-ed48bd3abff9",
    "document_id": "doc_87",
    "content": "How much muscle strength is required to walk in a crouch gait? Share Follow Project Follow publicly Follow privately Unfollow See followers (6) List Map More info 608 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Summary Browse source code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Summary Browse source code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow Use musculoskeletal modeling to determine how robost unimpaired and crouch gait are to weakness of individual muscle groups. Individuals with cerebral palsy (CP) who walk in a crouch gait often receive strength training as part of their therapy. An underlying assumption is that these individuals do not have adequate muscle strength to walk in an upright posture, and strengthening weak muscle groups will enable these individuals to improve their knee extension. However, outcomes from strength training programs for individuals with cerebral palsy and crouch gait are inconsistent. The purpose of this project is to determine how much strength is required to walk in a crouch gait and compare this to unimpaired gait. Identifying which muscle groups require more or less force to maintain a crouch gait versus an upright gait can provide guidance for designing effective strength training programs for individuals with CP who walk in a crouch gait. 0 downloads 3 forum posts 6 followers Last updated Feb 8, 2011 Project Statistics Join Mailing Lists Suggest Idea Katherine Steele Marjolein van der Krogt Scott Delp People also viewed EMG-informed Computed Muscle Control for Dynamic... Simulations of Crouch Gait Calibrated EMG-Informed Neuromusculoskeletal... Dynamic Arm Simulator Platform for Dynamic Simulation and Control of... Hip Musculoskeletal Model Efficient Methods for Multi-Domain Biomechanical... OpenArm: Volumetric & Time Series Models of Muscle... See all Simulating the effects of weakness and muscle... How Robust is Human Gait to Calf Muscle Shortening? Muscle-actuated Simulation of Human Running Simbody: Multibody Physics API OpenSim plugin to extract the muscle lines of action Muscle contributions to mass center... Dynamic Simulation of Movement Based on OpenSim and... SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
    "metadata": {
      "source": "https://simtk.org/projects/crouch_strength",
      "title": "SimTK: How much muscle strength is required to walk in a crouch gait?: Project Home",
      "section": "",
      "hierarchy": [
        "projects",
        "crouch_strength"
      ],
      "content_type": "reference",
      "position": 0,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  }
]