[
  {
    "id": "4cdf9d34-8d6e-4b23-b84a-19be30533680",
    "document_id": "doc_10",
    "content": "RNA Biocomputational methods complement experimental techniques to expand our understanding of RNA, molecules vital to the normal expression of genes within our bodies. Featured projects Recently updated projects total projects 68 projects with downloads Search projects in this category News New package added: MMB 3.14 for Windows MMB (MacroMoleculeBuilder) Apr 7, 2021 ForceBalance version 1.7.0 released! ForceBalance : Systematic Force Field Optimization Dec 3, 2019 OpenSim gets high marks as a multibody system simulator Simbody: Multibody Physics API Aug 3, 2015 Publications P. Eastman, J. Swails, J. D. Chodera, R. T. McGibbon, Y. Zhao, K. A. Beauchamp, L.-P. Wang, A. C. Simmonett, M. P. Harrigan, C. D. Stern, R. P. Wiewiora, B. R. Brooks, and V. S. Pande. \"OpenMM 7: Rapid development of high performance algorithms for molecular dynamics.\" PLOS Comp. Biol. 13(7): e1005659. Tek, A., Korostelev, A.A. and Flores, S.C. (2015) MMB-GUI: a fast morphing method demonstrates a possible ribosomal tRNA translocation trajectory. Nucleic Acids Res., 10.1093/nar/gkv1457. Wang, L-P., Martinez, T. J. and Pande, V.S. \"Building force fields - an automatic, systematic and reproducible approach\", submitted. Discussion THIS FORUM IS MOVING TO GITHUB! OpenMM Feb 24, 2025 Re: Help Needed with Drude Modeling for Molten Salts in OpenMM OpenMM Feb 19, 2025 Re: Combining AMD integrator with Langevin integrator OpenMM Feb 13, 2025 SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
    "metadata": {
      "source": "https://simtk.org/category/category.php?cat=307&sort=date&page=0&srch=&",
      "title": "SimTK: Project category",
      "section": "",
      "hierarchy": [
        "category",
        "category.php"
      ],
      "content_type": "reference",
      "position": 0,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  }
]