[
  {
    "id": "9b824b57-367a-4720-884a-3c79e77c45e6",
    "document_id": "doc_35",
    "content": "University of Gävle a.menicacci@me.com Armando Body movement analysis Institution: UQAM Salhi Asma Shoulder Joint Biomechanics, Pediatric Shoulder Pathologies, Total and Reverse Shoulder Arthroplasties, Musculoskeletal Modeling, Statistical Shape Model based Biomechanics, Musculoskeletal Disorders, Machine Learning. Institution: LaTIM Michael Asmussen Institution: Mount Royal University Mansour Attaallah Institution: Alexandria jalil azardoost Institution: guilan university Subham Badhyal Institution: Indian Institute of Technology Ropar Ju-hwan Bae Institution: COMWEL Korea Orthopedics and Rehabilitation Engineering Center Keeran Balachandran Institution: University of Auckland alireza balaghi interest_simtk Institution: azadfaraz club malihe baraz Institution: basu Nicholas Bianco Institution: Stanford University Dimitra Blana Simulation of upper limb movement Institution: University of Aberdeen Edgar Bolívar-Nieto Estimation of lower-limb biomechanics from motion capture and force plate data. Institution: University of Notre Dame Edilson Borba Institution: UFPR Andreas Bourantanis Institution: University of Dundee Jake Bowd Institution: Cardiff University Marcus Brookshaw Gait analysis. Institution: Univeristy of New Brunswick Gabriel Bucio Caballero Institution: unam Tiago Canal Institution: CNPq Guillaume Cara Institution: UPHF attilio caravelli I am an experienced electronic engineer with 10 years of professional career and extensive experience in IT. I have skills in genetics and neuromorphic computing. Currently part of my free time is dedicated to studying nanotechnology for medicine and genetics just for personal challenge. Institution: Polytechnic University of Turin Axelle CARON Institution: Matmeca Gabriel Carreño Institution: Universidad Central de Chile Dario Cazzola Biomechanical modelling of cervical spine Institution: University of Bath Carlos CEVALLOS Doctor in Motor Sciences Institution: Universite Libre de Bruxelles Saikat Chakraborty Institution: National Institute of Technology Rourkela DEEPAK CHAUDHARY Institution: ZHCET AMU ALIGARH Manvendra Chauhan Institution: Vikash chaurasia Institution: oist Paul Chris Institution: 佳木斯大学 Uchechuku Chukudi Musculoskeletal Modelling and Analysis Institution: University of Salfrod Yosbel Cisneros Institution: university of camaguey jairo contreras Mundos virtuales con OpenSim Institution: UTPL Ulises Contreras Biomechanics Institution: PUCP Marcos Crespo Institution: FLENI João Cunha Institution: Faculty of Enginnering at University of Porto, Portugal Danilo Curci Medical doctor, psychologist, interested on applications of virtual worlds for training, learning, teaching, sharing experiences Institution: Psicologia Virtuale jimmy d Institution: Independent James Day Institution: University of Queensland Renee Degutis Institution: SHSU David Deimel Institution: Universität Wien Christopher Dembia Research. Institution: Stanford University Rud Derie Institution: Ghent University Andrea Di Pietro Musculoskeletal modelling Joint implant wear tests Sport biomechanics Motion analysis Finite Element Analysis Institution: University of Pisa Kamila Dostálová Institution: VSB-Technical University of Ostrava sky du Institution: ftx Eric Dugan Clinical Gait Analysis ACL Institution: Texas Children's Hospital su east IK Institution: Peking University Julie Ellis Institution: University of Saskatchewan Nermen Es To learn muscles simulation Institution: Tishreen Katie Ewing My PhD project investigates the efficacy of knee braces in preventing knee injury during landing. Institution: University of Melbourne Carlos Fliger Institution: Universidad Nacional de Entre Ríos - Bioingeniería Brooke Fosaaen Institution: Washington University School of Medicine Bruno Gallo I'm studyng biomedical engineering and i want know how to work OpenSim for my studies and also for understand biomechanics. Institution: University of Catanzaro (Italia) Amartya Ganguly Biomechanics Musculoskeletal modelling Sensory Feedback Postural Control Rehabilitation Institution: Keele University JUAN",
    "metadata": {
      "source": "https://simtk.org/plugins/following/index.php?group_id=91",
      "title": "SimTK: OpenSim: Project Home",
      "section": "OpenSim Share Follow Project Follow publicly Follow privately Unfollow See followers (313) List Map More info 91 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News 233 public followers and 80 private followers What does it mean to follow a project? Display followers in: List Map mostafa Abdelrahman Institution: Ain shams Neda Abdollahi Institution: Cleveland Clinic Ahmed abdulameer Institution: university of baghdad Eugene Ablordeppey Institution: Virginia Commonwealth University Deniz Ak Institution: Politecnico di Milano HASSAN AKBARPOUR Institution: Iran_Tabriz university_college of new technologies Rabé Andersson Winter school project Institution:",
      "hierarchy": [
        "plugins",
        "following",
        "index.php"
      ],
      "content_type": "reference",
      "position": 0,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  },
  {
    "id": "44959a06-7fa4-4a25-890b-bccd5fd06e5e",
    "document_id": "doc_35",
    "content": "su east IK Institution: Peking University Julie Ellis Institution: University of Saskatchewan Nermen Es To learn muscles simulation Institution: Tishreen Katie Ewing My PhD project investigates the efficacy of knee braces in preventing knee injury during landing. Institution: University of Melbourne Carlos Fliger Institution: Universidad Nacional de Entre Ríos - Bioingeniería Brooke Fosaaen Institution: Washington University School of Medicine Bruno Gallo I'm studyng biomedical engineering and i want know how to work OpenSim for my studies and also for understand biomechanics. Institution: University of Catanzaro (Italia) Amartya Ganguly Biomechanics Musculoskeletal modelling Sensory Feedback Postural Control Rehabilitation Institution: Keele University JUAN FRANCISCO GARCÍA VÁZQUEZ Institution: FREMAP MUTUA Ali Ghaffari Institution: Kharazmi University M. Hosein Ghasemi Institution: univerity of Bu-Ali Sina Aseel Ghazwan Institution: Cardiff University Kristy Godoy Areas of interest: Wheelchair propulsion biomechanics and movement analysis; Using BTS SmartD system at the moment. Institution: Universidade Federal de Rio de Janeiro Carlos Gonçalves Institution: SARAH Network of Rehabilitation Hospitals Helge Gudmundsen Institution: None Dhruv Gupta Institution: The University of Texas at Austin taehyun ha Institution: asan Eni Halilaj Institution: Carnegie Mellon University Muhammad Hamdan Biomechanics, Rehab, Strength and Conditioning researches in motion Institution: Universiti Teknologi MARA Isabella Harker Institution: University of Oregon Chris Hayot Institution: ESP-Consulting Chuan He Institution: Tianjin University Poramet Hemarachatanon Opensim Institution: Walailak Uni. Jennifer Hicks As the OpenSim R&D Manager, I am focused on guiding the development of OpenSim and facilitating its use in research and clinical settings around the world. Institution: Stanford University Tod Hing Institution: Stanford akbar hojjati Institution: islamic azad university of majlesi wk hong Institution: SNUH Mo Hossny Integration with Wii Institution: Deakin University Tassos Hourmouziadis Institution: eworks dongyuan hu multibody dynamics Institution: Tencent qi huan Institution: 东北大学 Po Hsun Huang Institution: National Chiao Tung University (Taiwan) Taj Im Institution: UoHB Nathanael Inkson Simulation of biomechanics for a book Institution: Siemens PLM Henry Isaac Institution: MNNIT Julie Iskander Institution: Deakin Daniel Jacobs Institution: Temple University Vahidreza Jafari Institution: The University of Melbourne Deepak Jindal Institution: Punjab Engineering University TSENG Ji Yang Institution: National Yunlin University and Technology LEE JUSUNG I am interested in research to prevent injury to the lower extremities when walking, running or landing. Institution: KISS Derya Karabulut Institution: Istanbul university Parashar Karthick About musculoskeletal simulation: opensim Institution: Independent Dmytro Kazanzhy Institution: GenomicsUA Mousa Kazemi Knee FE model Institution: Auckland Bioengineering Institute Mohamad Reza Kharazi spasticity, Cerebral palsy Institution: Mohamad Reza Kharazi tuba kiani Institution: uet lhr Seungyeon Kim Institution: Seoul National University Hide Kimpara Institution: Worcester Polytechnic Institute Łukasz Kożuchowski Institution: Independent Andrew Kraszewski Application to biomechanical and rehabilitation research. Improving musculoskeletal models for human movement science. Institution: New York University; Hospital for Special Surgery Joy Ku data and software sharing, scientific reproducibility, mHealth, physics-based simulation, OpenSim and the NIH-funded Restore Center (http://restore.stanford.edu) Institution: Stanford University YU LAN Institution: University Andrew LaPre Simulating use of new robotic lower limb prostheses. Institution: UMass Amherst Seven Lau Institution: China University of petroleum andrea Leo Institution: shenyangligong university Junnan Li Institution: tum chan liang",
    "metadata": {
      "source": "https://simtk.org/plugins/following/index.php?group_id=91",
      "title": "SimTK: OpenSim: Project Home",
      "section": "OpenSim Share Follow Project Follow publicly Follow privately Unfollow See followers (313) List Map More info 91 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News 233 public followers and 80 private followers What does it mean to follow a project? Display followers in: List Map mostafa Abdelrahman Institution: Ain shams Neda Abdollahi Institution: Cleveland Clinic Ahmed abdulameer Institution: university of baghdad Eugene Ablordeppey Institution: Virginia Commonwealth University Deniz Ak Institution: Politecnico di Milano HASSAN AKBARPOUR Institution: Iran_Tabriz university_college of new technologies Rabé Andersson Winter school project Institution:",
      "hierarchy": [
        "plugins",
        "following",
        "index.php"
      ],
      "content_type": "reference",
      "position": 1,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  },
  {
    "id": "90ea56a7-6c2d-4299-9efd-545e68c2c1b1",
    "document_id": "doc_35",
    "content": "tuba kiani Institution: uet lhr Seungyeon Kim Institution: Seoul National University Hide Kimpara Institution: Worcester Polytechnic Institute Łukasz Kożuchowski Institution: Independent Andrew Kraszewski Application to biomechanical and rehabilitation research. Improving musculoskeletal models for human movement science. Institution: New York University; Hospital for Special Surgery Joy Ku data and software sharing, scientific reproducibility, mHealth, physics-based simulation, OpenSim and the NIH-funded Restore Center (http://restore.stanford.edu) Institution: Stanford University YU LAN Institution: University Andrew LaPre Simulating use of new robotic lower limb prostheses. Institution: UMass Amherst Seven Lau Institution: China University of petroleum andrea Leo Institution: shenyangligong university Junnan Li Institution: tum chan liang I Wanna to create some muscle bodies. Institution: Nanjing Sport Institute David Logan Institution: Drexel University College of Medicine Wenlong Ma Institution: California Institute of Technology Shwetha Macheri Ravishankar To Model the Human Leg Institution: T U Delft Byron Maeda To analyse sport technique in Guatemala Institution: CDAG maher mahdavi opensim mahermahdavi90@gmail.com Institution: shiraz university of medical science mohammad mahmoodi Institution: kntu nima majd Institution: Qazvin Islamic Azad University Dmitry Malakhov Institution: RNRMU mohammad malekzadeh arasteh Institution: tehran university Terry Martin Institution: Semantic Press Tommy McMichen I am a compiler researcher Institution: Northwestern University Fabrice MEGROT Institution: French Red Cross Pouyan Mehryar Institution: University of Leeds Uğur Mengilli Metabolic rate optimization Institution: Sabancı Üniversitesi Benben Miao Institution: AiBio stuart miller Institution: Middlesex University Cecilia Monoli Institution: Tal Tech Luis Montesinos Research on falls prediction Institution: University of Warwick Denis César Mosconi Pereira Simulate an exoskeleton model. Institution: Universidade de São Paulo Vignayanandam R. Muddapu To build neuronal network-based mechanical model of the arm Institution: Indian Institute of Technology Madras Alison Murray Institution: University of Victoria Mohamed Nafea i want to learn how to use it to make use of it in my graduation project which is about designing an orthotic leg for helping patients having foot drop. Institution: Faculty of Engineering, Ain Shams University, Cairo, Egypt Marien Narváez Institution: Universidade de Brasilia Caitlin Neher Institution: University of Washington geraldo netto Institution: universitat Duisburg Essen Vinh Nguyen Institution: University of Massachusetts - Amherst Marcos Alfredo Núñez Institution: FLENI John O Connor Orthopedic biomechanics Institution: Queens University, Belfast fethi okyar to carry out multi-body dynamic analyses in our computational biomechanics lab Institution: yeditepe university Karpinska Olena Institution: SYTENKO INSTITUTE OF SPINE AND JOINT PATHOLOGY Can Ozcan As a biomedical engineering phd candidate, I am interested in alternative solutions for biomechanics. Institution: Akro Muhendislik, Bogazici University Sudeshna Pal Institution: University of Central Florida Rahul Pandey Institution: Stanford University Heewon Park Institution: KAIST Gunjan Patel Gait Analysis, Human movement analysis, Wearable gait monitoring systems, Algorithm and software tool and app development Institution: IIT Madras Arvind Kumar Pathak Solids modeling of biomechanical systems Institution: Dr. B R Ambedkar National Institute of Technology Jalandhar Antonio Pereira Institution: Federal University of Pará Claudio Pizzolato Development of a visual biofeedback technology based on the estimation of muscle force in real-time. Institution: Griffith University Bruce Portnoff Institution: University of Michigan Soha Pouya Institution: Stanford University Pierre PUCHAUD Institution: IRISA",
    "metadata": {
      "source": "https://simtk.org/plugins/following/index.php?group_id=91",
      "title": "SimTK: OpenSim: Project Home",
      "section": "OpenSim Share Follow Project Follow publicly Follow privately Unfollow See followers (313) List Map More info 91 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News 233 public followers and 80 private followers What does it mean to follow a project? Display followers in: List Map mostafa Abdelrahman Institution: Ain shams Neda Abdollahi Institution: Cleveland Clinic Ahmed abdulameer Institution: university of baghdad Eugene Ablordeppey Institution: Virginia Commonwealth University Deniz Ak Institution: Politecnico di Milano HASSAN AKBARPOUR Institution: Iran_Tabriz university_college of new technologies Rabé Andersson Winter school project Institution:",
      "hierarchy": [
        "plugins",
        "following",
        "index.php"
      ],
      "content_type": "reference",
      "position": 2,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  },
  {
    "id": "8dc06110-1299-460f-817f-b7e53c7673b1",
    "document_id": "doc_35",
    "content": "Muhendislik, Bogazici University Sudeshna Pal Institution: University of Central Florida Rahul Pandey Institution: Stanford University Heewon Park Institution: KAIST Gunjan Patel Gait Analysis, Human movement analysis, Wearable gait monitoring systems, Algorithm and software tool and app development Institution: IIT Madras Arvind Kumar Pathak Solids modeling of biomechanical systems Institution: Dr. B R Ambedkar National Institute of Technology Jalandhar Antonio Pereira Institution: Federal University of Pará Claudio Pizzolato Development of a visual biofeedback technology based on the estimation of muscle force in real-time. Institution: Griffith University Bruce Portnoff Institution: University of Michigan Soha Pouya Institution: Stanford University Pierre PUCHAUD Institution: IRISA Vishal R Control of transfemoral prosthesis Institution: University of Groningen Hatem Rabei Institution: Helwan University arun ramakrishnan Institution: Drexel University R Yogeshwar Rao Rao Institution: IIT, Bombay Aviva Ratzer Institution: Open u Amir Razmi Institution: MIT Mikael Reimeringer I´m interested in finding out if Opensim can assist us in some way and give us more tools in out Gait and movement analyzis lab to further help our ortopaedic surgeons in treatment plans Institution: Karolinska Institutet fateme rezaie Institution: bu-ali university shadi rg Institution: alzahra Mark Ricard Institution: University of Texas Arlington Marco Romanato Institution: Università degli studi di Padova Christina Rossi Institution: Virginia Tech Marcel Rossi Institution: Sport Singapore LUO RUIMING My interest is to model musculoskeletal system of human(especially for lower limb) to help design exoskeleton for walking assistance. Institution: Zhejiang University ali safaeifar Institution: sharif university of technology everardo sanchez Institution: universidad simon bolivar Keela Sanders Institution: Southern Oregon University Paulo Santiago sports biomechanics Institution: University of Sao Paulo - USP Ribeirao Preto Hassan Sardar Institution: NUST Karine Sarro I am interested in OpenSim to study injury risk in sport and exercise Institution: University of Campinas Adrián Schmedling Institution: University of the Basque Country Khuram Shahzad Institution: university of Glasgow Ahmad Shaikh I have previously worked on FeBio, Abaqus, custom matlab and python codes to study cardiovascular biomechanics. So far, my studies have been on solid mechanics and idealised geometries. To venture into the realm of patient-specific models and hemodynamics, I hope to dive into the world of SimVascular Institution: BMS College of Engineering tongji shang Institution: tongji Alana Sharp Institution: University of Liverpool Keli Shen Balance control Institution: Tohoku University Hayden Sidey-Phillips Institution: University of British Columbia Andrew Slateff Biomechanics, Kinematics, Kinematic Geometry, Motion Analysis, Dynamics, Dynamical Systems, Multiple Scale Systems, Singular Perturbations, Sports Biomechanics, Multibody Systems, Robotics, Running, Cross Country Skiing, Strength Training, Sensorimotor Training Institution: TU Vienna Per Slycke Institution: Moveshelf Drew Smith Professor and Director of the Motion Analysis Research Center at Samuel Merritt University, Oakland CA Institution: Samuel Merritt University Rene Solis Arduino RaspberryPi Linux Institution: Instituto tecnologico de Tijuana Sankalp Soni Dynamic analysis of Lower Extremity using Multibody Approach. Institution: A. D. Patel Institute of Technology Ehsan Soodmand Institution: TU Chemnitz Thales Souza Opensim Institution: UFMG Dimitar Stanev Biomechanics, modeling and simulation, movement analysis, knee, neurodegenerative disorders, digital biomarkers Institution: Capgemini Engineering Kenji Takeda Gait cycle, Muscle synergy Institution: Nihon-university terry terry",
    "metadata": {
      "source": "https://simtk.org/plugins/following/index.php?group_id=91",
      "title": "SimTK: OpenSim: Project Home",
      "section": "OpenSim Share Follow Project Follow publicly Follow privately Unfollow See followers (313) List Map More info 91 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News 233 public followers and 80 private followers What does it mean to follow a project? Display followers in: List Map mostafa Abdelrahman Institution: Ain shams Neda Abdollahi Institution: Cleveland Clinic Ahmed abdulameer Institution: university of baghdad Eugene Ablordeppey Institution: Virginia Commonwealth University Deniz Ak Institution: Politecnico di Milano HASSAN AKBARPOUR Institution: Iran_Tabriz university_college of new technologies Rabé Andersson Winter school project Institution:",
      "hierarchy": [
        "plugins",
        "following",
        "index.php"
      ],
      "content_type": "reference",
      "position": 3,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  },
  {
    "id": "7cc5462f-4342-4694-bc48-08408481cd8f",
    "document_id": "doc_35",
    "content": "Robotics, Running, Cross Country Skiing, Strength Training, Sensorimotor Training Institution: TU Vienna Per Slycke Institution: Moveshelf Drew Smith Professor and Director of the Motion Analysis Research Center at Samuel Merritt University, Oakland CA Institution: Samuel Merritt University Rene Solis Arduino RaspberryPi Linux Institution: Instituto tecnologico de Tijuana Sankalp Soni Dynamic analysis of Lower Extremity using Multibody Approach. Institution: A. D. Patel Institute of Technology Ehsan Soodmand Institution: TU Chemnitz Thales Souza Opensim Institution: UFMG Dimitar Stanev Biomechanics, modeling and simulation, movement analysis, knee, neurodegenerative disorders, digital biomarkers Institution: Capgemini Engineering Kenji Takeda Gait cycle, Muscle synergy Institution: Nihon-university terry terry just learning Institution: Shu-Zen Junior College of Medicine and Management Chetan Thakur Study effects of assistive suit and exoskeleton on human muscle and movement. Institution: Hiroshima University Millen James Theophilus I am a student studying MSc. Sport Biomechanics. Institution: Loughborough University William Thompson Institution: NASA Glenn Research Center Junjie Tian Institution: Yanshan University xie tianming Institution: heu Haruki Toda Institution: Kobe University GEORGIY TOKUNOV Institution: Skoltech LONG TUNG Institution: University of technology Rory Turnbull Human and exoskeleton motion Institution: University of Leeds Fildiaz Utama Institution: ITP Stefan van Drongelen Institution: Orthopaedic University Hospital Friedrichsheim gGmbH Julio Vargas-Riano Rehabilitation Robotics. Institution: Universitat Politecnica de Valencia Paavo Vartiainen Motion capture, Gait analysis, Biomechanics, State-space estimation, clinical trials Institution: University of Eastern Finland Lijo Varughese Chacko Institution: University of Strathclyde Prabhakaran Vasantharajan to simulate biomechanic orthosis and amputee assisting structures Institution: National Institute of Technology, Calicut Shayne Vial Ph.D. student investigating injuries in elite soccer players Institution: Edith Cowan University AGATA VIZCAYA Institution: MUTUALIA Chao Wang Upper Extremity motor assessment Institution: University of Leeds wenbin Wang Institution: Tongji University Ryan Wedge I am interested in using modeling and simulation techniques to study the effects of different prostheses on the energetics and dynamics of locomotion. Institution: University of Massachusetts Amherst lin weijian Institution: xi'an jiaotong university bao wendy apply opensim to automobile Institution: jilin university P Wesberg Research on biomechanical models and motion capture for applied motion analysis in simulation processes. Institution: Berlin University of Applied Science Gusti Winata I have undergrad thesis to build motion capture system that would combine IMU sensor system and Multi Camera inference Institution: Bandung Institute of Technology Bessie Wu Institution: National Tsing Hua University Shuai Wu Institution: Shenzhen University York Wu Institution: university of science and technology of china Qi Xing Lumbar Spine Institution: George Mason University Sergiy Yakovenko Applications: 1) neuromuscularskeletal (NMS) models of cat & human locomotion; 2) development of Matlab-OpenSim APIs; 3) development of data management APIs. Institution: University of Pittsburgh Hamit Yanalak For biomedical engineering project Institution: Çukurova University Zhang Yanyan Institution: Zhejiang lab fateme yaseri Institution: iran university of sience and technology Wayne Yin Institution: Texas A&M University feng yuming Institution: CRRC Rahid Zaman I want to simulate the Musculoskeletal model of Human body in various conditions. Institution: Oklahoma Syate University Milad Zarei Institution: Cleveland State University zhifei zhang Musculoskeletal Models Institution: chongqing University Nianlei Zhang Institution: TU Delft Yang Zhang Institution: Shenyang",
    "metadata": {
      "source": "https://simtk.org/plugins/following/index.php?group_id=91",
      "title": "SimTK: OpenSim: Project Home",
      "section": "OpenSim Share Follow Project Follow publicly Follow privately Unfollow See followers (313) List Map More info 91 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News 233 public followers and 80 private followers What does it mean to follow a project? Display followers in: List Map mostafa Abdelrahman Institution: Ain shams Neda Abdollahi Institution: Cleveland Clinic Ahmed abdulameer Institution: university of baghdad Eugene Ablordeppey Institution: Virginia Commonwealth University Deniz Ak Institution: Politecnico di Milano HASSAN AKBARPOUR Institution: Iran_Tabriz university_college of new technologies Rabé Andersson Winter school project Institution:",
      "hierarchy": [
        "plugins",
        "following",
        "index.php"
      ],
      "content_type": "reference",
      "position": 4,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  },
  {
    "id": "e2bd5e89-076d-4cbf-a881-c78464790f57",
    "document_id": "doc_35",
    "content": "Yakovenko Applications: 1) neuromuscularskeletal (NMS) models of cat & human locomotion; 2) development of Matlab-OpenSim APIs; 3) development of data management APIs. Institution: University of Pittsburgh Hamit Yanalak For biomedical engineering project Institution: Çukurova University Zhang Yanyan Institution: Zhejiang lab fateme yaseri Institution: iran university of sience and technology Wayne Yin Institution: Texas A&M University feng yuming Institution: CRRC Rahid Zaman I want to simulate the Musculoskeletal model of Human body in various conditions. Institution: Oklahoma Syate University Milad Zarei Institution: Cleveland State University zhifei zhang Musculoskeletal Models Institution: chongqing University Nianlei Zhang Institution: TU Delft Yang Zhang Institution: Shenyang Jianzhu University Kuhn Zhao Institution: SEU rui zhou Institution: lan zhou univerity of tecology Le Zhou Institution: Oklahoma State University 龙 黄 Institution: 北京体育大学 836,655 downloads 25011 forum posts 313 followers Last updated Mar 20, 2025 Project Statistics Join Mailing Lists Suggest Idea Scott Delp Jennifer Hicks Ayman Habib Carmichael Ong Ajay Seth Thomas Uchida SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
    "metadata": {
      "source": "https://simtk.org/plugins/following/index.php?group_id=91",
      "title": "SimTK: OpenSim: Project Home",
      "section": "OpenSim Share Follow Project Follow publicly Follow privately Unfollow See followers (313) List Map More info 91 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News 233 public followers and 80 private followers What does it mean to follow a project? Display followers in: List Map mostafa Abdelrahman Institution: Ain shams Neda Abdollahi Institution: Cleveland Clinic Ahmed abdulameer Institution: university of baghdad Eugene Ablordeppey Institution: Virginia Commonwealth University Deniz Ak Institution: Politecnico di Milano HASSAN AKBARPOUR Institution: Iran_Tabriz university_college of new technologies Rabé Andersson Winter school project Institution:",
      "hierarchy": [
        "plugins",
        "following",
        "index.php"
      ],
      "content_type": "reference",
      "position": 5,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  }
]