[
  {
    "id": "b1049a4d-fd2b-4e66-aa37-f7bea74950ad",
    "document_id": "doc_21",
    "content": "369, 2020. Choy JS, Leng S, Acevedo-Bolton G, Shaul S, Guo X, Zhong L, Guccione JM, Kassab GS. Efficacy of Intramyocardial Injection of Algisyl-LVR for the treatment of Ischemic Heart Failure in Swine. (Under Review in Circulation Research) Inouye JM, Handsfield GG, and Blemker SS. Fiber tractography for finite-element modeling of transversely isotropic material structures of arbitrary shape using computational fluid dynamics. Proceedings of the 2015 Summer Simulation Multi-Conference. Discussion Re: Ten Simple Rules Survey Data Analysis Credible Practice of Modeling & Simulation in Healthcare Jan 28, 2025 Re: Follow up discussion for webinars Credible Practice of Modeling & Simulation in Healthcare Jan 27, 2025 Re: Workflows & Standards & good practices Credible Practice of Modeling & Simulation in Healthcare Sep 6, 2024 Administrators Joy Ku Grace Peng Jacklyn Ebiasah SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
    "metadata": {
      "source": "https://simtk.org/category/communityPage.php?cat=1004&sort=date&page=0&srch=&",
      "title": "SimTK: Community",
      "section": "IMAG/MSM Consortium The Consortium is a group of researchers interested in the activities to grow the field of multiscale modeling in biomedical, biological and behavioral systems and promote multidisciplinary scientific collaboration Featured projects Related communities Recently updated projects total projects 3 projects with downloads See all community projects Add project to community News The Reference Model for COVID-19 - The First Multi-Scale Ensemble Disease Model The Reference Model for Disease Progression Jun 6, 2021 Publication on Ten Rules for Credible Practice of Modeling and Simulation in Healthcare Credible Practice of Modeling & Simulation in Healthcare Oct 21, 2020 The Reference Model now models COVID-19 The Reference Model for Disease Progression Jul 31, 2020 Publications Erdemir, A, Mulugeta, L, Ku, JP, Drach, A, Horner, M, Morrison, TM, Peng, GCY, Vadigepalli, R, Lytton, WW, Myers, JG, \"Credible Practice of Modeling and Simulation in Healthcare: Ten Rules from a Multidisciplinary Perspective,\" Journal of Translational Medicine, 18:",
      "hierarchy": [
        "category",
        "communityPage.php"
      ],
      "content_type": "reference",
      "position": 0,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  }
]