[
  {
    "id": "a6bff19f-decb-4bb8-8bfa-ebff635882f1",
    "document_id": "doc_6",
    "content": "Cell Biocomputational methods complement experimental techniques to expand our understanding of the cell, the basic unit of life. Featured projects Recently updated projects total projects 23 projects with downloads Search projects in this category News New file added: Muscle_atrophy.nlogo Agent-based model of skeletal muscle disuse-induced atrophy Apr 1, 2016 Publications Catherine A. Rivet , Ariel S. Kniss-James , Margaret A. Gran, Anish Potnis, Abby Hill, Hang Lu, Melissa L. Kemp. \"Calcium Dynamics of Ex Vivo Long-Term Cultured CD8+ T Cells Are Regulated by Changes in Redox Metabolism\". PLoS One: e0159248, 2016. \"Competing Mechanistic Hypotheses of Acetaminophen-Induced Hepatotoxicity Challenged by Virtual Experiments\" Andrew K. Smith, Brenden K. Petersen, Glen E. P. Ropella, Ryan C. Kennedy, Neil Kaplowitz, Murad Ookhtens, C. Anthony Hunt. PLoS Comput Biol. 2016 Dec 16;12(12):e1005253 Kumar, Sandeep, et al. \"Proteolytic and non-proteolytic regulation of collective cell invasion: tuning by ECM density and organization.\" Scientific reports 6 (2016). Discussion What is aeva? Practical Annotation and Exchange of Virtual Anatomy Jan 22, 2021 Practical Annotation and Exchange of Virtual Anatomy Public Forum Practical Annotation and Exchange of Virtual Anatomy Aug 31, 2019 T cell calcium dynamics regulated by age-induced oxidation Public Forum T cell calcium dynamics regulated by age-induced oxidation Jul 10, 2016 SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
    "metadata": {
      "source": "https://simtk.org/category/category.php?cat=421&sort=date&page=0&srch=&",
      "title": "SimTK: Project category",
      "section": "",
      "hierarchy": [
        "category",
        "category.php"
      ],
      "content_type": "reference",
      "position": 0,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  }
]