[
  {
    "id": "c67b2ee5-01f2-49a2-9bfb-69274b1b613e",
    "document_id": "doc_66",
    "content": "2017 Fall OpenSim Virtual Workshop Cost function sensitivity in predictive... Enhancing Accuracy and Reliability of Spinal Load... Finite element simulations of prosthesis socket... Flexing Computational Muscle: Modeling... How Robust is Human Gait to Calf Muscle Shortening? How Tendon Compliance Affects the Metabolic Cost... Marker registration method informed by anatomical... See all May Liu's Walking Simulations Multiple Speed Walking Simulations Muscle constitutive model with actin-titin binding... Muscle constitutive model with a tangent modulus... OpenSense model of motor variability for gait OpenSim Platform for Dynamic Simulation and Control of... Predictive Simulation of Loaded and Inclined... Quantifying uncertainty in inverse analyses... Simbody: Multibody Physics API Simulated Assistive Devices for Loaded Walking Simulating Ideal Assistive Devices to Reduce the... Theia3D to OpenSim: Utilities to fit an OpenSim model from... SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
    "metadata": {
      "source": "https://simtk.org/users/tkuchida",
      "title": "SimTK: Thomas Uchida",
      "section": "Thomas Uchida University of Ottawa Department of Mechanical Engineering Personal website Contact Member since May 16, 2012 Member of 21 projects Total forum posts: 1808 Last forum post: Mar 11, 2025 Projects Thomas Uchida is a member of the following projects:",
      "hierarchy": [
        "users",
        "tkuchida"
      ],
      "content_type": "reference",
      "position": 0,
      "tags": [
        "reference",
        "general",
        "intermediate"
      ]
    }
  }
]