{
  "id": "doc_102",
  "url": "https://simtk.org/projects/notremor/",
  "title": "SimTK: Neuromuscular Models for the Predictive Treatment of Parkinson's Disease: Project Home",
  "content_type": "reference",
  "category": "general",
  "hierarchy": [
    "projects",
    "notremor"
  ],
  "difficulty": "intermediate",
  "raw_text": "Neuromuscular Models for the Predictive Treatment of Parkinson's Disease Share Follow Project Follow publicly Follow privately Unfollow See followers (6) List Map More info 945 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Summary Browse source code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Summary Browse source code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow This project aims to model and simulate the function of the brain and of the neuromuscular system as a whole, in order to explore  new treatments of Parkinson's Disease. Download Latest Releases Saccade Simulator: SaccadeSimulator.zip License: Saccade Simulator NoTremor aims to provide patient specific computational models of the coupled brain and neuromuscular systems that will be subsequently used to improve the quality of analysis, prediction and progression of Parkinson’s disease. In particular, it aspires to establish the neglected link between brain modelling and neuromuscular systems that will result in a holistic representation of the physiology for PD patients. 124 downloads 2 forum posts 6 followers Last updated Sep 4, 2017 Project Statistics Join Mailing Lists Suggest Idea Chris Papapavlou Dimitar Stanev Konstantinos Moustakas People also viewed Evaluation of In Vivo Knee Load Predictions Using... EMG-informed Computed Muscle Control for Dynamic... Are subject-specific musculoskeletal... Spasticity model in OpenSim MB Knee: Multibody Models of the Human Knee Simulations of Crouch Gait Below-Knee Amputee Model Stiff-knee walking simulations See all An OpenSim plugin to minimize joint reaction forces and... Efficient Methods for Multi-Domain Biomechanical... A Visualization Tool for OpenSim Functional Electrical Stimulation... Multidimensional Cubic B-Spline Model of the Scapulothoracic Joint Dynamic Musculoskeletal Model of the... SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
  "extracted_date": "2025-03-29 22:21:14"
}