{
  "id": "doc_95",
  "url": "https://simtk.org/projects/runham",
  "title": "SimTK: Hamstring Function During Running: Project Home",
  "content_type": "reference",
  "category": "general",
  "hierarchy": [
    "projects",
    "runham"
  ],
  "difficulty": "intermediate",
  "raw_text": "Hamstring Function During Running Share 642 This is a private project. You must be a member to view its contents. The goal of this project is to determine the contributions of the hamstrings and other muscled to joint accelerations at the hip and knee during running The goal of this project is to determine the contributions of the hamstrings and other muscled to joint accelerations at the hip and knee during running Denny Delp Sam Hamner People also viewed Muscle contributions to mass center... Muscle-actuated Simulation of Human Running EMG-informed Computed Muscle Control for Dynamic... Sam's Simulations How much muscle strength is required to walk in... Multiple Speed Walking Simulations OpenArm: Volumetric & Time Series Models of Muscle... Muscle function of overground running across a range of... See all Stroke gait Chand's Simulations Simulating Ideal Assistive Devices to Reduce the... How Tendon Compliance Affects the Metabolic Cost... Quantification of participant-specific iliotibial band... UW Pipeline Musculoskeletal Modelling of Hopping in Elastic... SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
  "extracted_date": "2025-03-29 22:20:54"
}