{
  "id": "doc_83",
  "url": "https://simtk.org/projects/osufullbody_sts",
  "title": "SimTK: Examining Muscle Forces during Sit to Stand Transfer with Full Body Model 2016: Project Home",
  "content_type": "reference",
  "category": "general",
  "hierarchy": [
    "projects",
    "osufullbody_sts"
  ],
  "difficulty": "intermediate",
  "raw_text": "Examining Muscle Forces during Sit to Stand Transfer with Full Body Model 2016 Share Follow Project Follow publicly Follow privately Unfollow See followers (10) List Map More info 951 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Summary Browse source code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Summary Browse source code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow The purpose of this study was to: 1) develop a model that would be adequate in analyzing the sit to stand (STS) transfer motion 2) examine individual muscle forces, their contributions to the acceleration of the center of mass, as well as inter-limb differences in muscle forces produced during the STS transfer in a young, healthy population. Download Latest Releases osufullbody_sts: Caruthers_FullBodyModel2016_Scaled_Arms.osim osufullbody_sts: Geometry_FINAL.zip Sample STS Transfer Data: Sample Data.zip License: Sample STS Transfer Data Our STS transfer analysis required a three-dimensional musculoskeletal model that had lower extremities, flexibility in the lumbar vertebrae, and arms. Capturing the dynamics of the lower back and arms was critical for 1) ensuring more dynamically accurate calculations of muscle forces and induced accelerations and 2) developing benchmark simulations for young healthy adults using a model that could be applied in future studies to capture possible compensatory strategies (e.g., the use of arms or torso) in various populations completing the STS transfer. Because no previously developed model met these criteria, we created a three-dimensional musculoskeletal model, the Full Body Model 2016, by combining these models: Lower Limb Model 2010, Musculoskeletal Model of the Lumbar Spine, MoBL-ARMS Upper Limb Model, and Head and Neck Musculoskeletal Biomechanics Model.  It has 46 degrees of freedom with 194 Hill-type muscle-tendon actuators. A description of how the model was assembled and evaluated is in Appendix 1 of our manuscript, Muscle Forces and Their Contributions to Vertical and Horizontal Acceleration of the Center of Mass during Sit-to-Stand Transfer in Young, Healthy Adults (see publications). Watch this video to get a sneak peek of STS transfer simulation with the Full Body Model 2016. http://www.youtube.com/v/j-o94qfJKvM &showsearch=0&rel=0&fs=1&autoplay=0≈=%2526fmt%3D18\" name=\"movie\" /> View on YouTube 1,813 downloads 4 forum posts 10 followers Last updated Apr 27, 2020 Project Statistics Join Mailing Lists Suggest Idea Elena Caruthers People also viewed Muscle contributions to mass center... Analysis of arm swing during human walking Sam's Simulations OpenSim A three-dimensional musculoskeletal model of the dog Evertor and invertor muscle co-activation... Multiple Speed Walking Simulations Spasticity model in OpenSim See all OpenSim Moco Hamstring Function During Running Full-body Musculoskeletal Model of the Lumbar... SPAN: Simulated parallel annealing by neighborhood Multidimensional Cubic B-Spline Chand's Simulations Tibial forces in independently ambulatory children... SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
  "extracted_date": "2025-03-29 22:20:20"
}