{
  "id": "doc_69",
  "url": "https://simtk.org/projects/opensim_data",
  "title": "SimTK: OpenSim Motion and Simulation Data: Project Home",
  "content_type": "reference",
  "category": "simulation",
  "hierarchy": [
    "projects",
    "opensim_data"
  ],
  "difficulty": "intermediate",
  "raw_text": "OpenSim Motion and Simulation Data Share Follow Project Follow publicly Follow privately Unfollow See followers (12) List Map More info 777 About Project summary Project statistics Project Activity Plots Geography of Use Team members About Project summary Project statistics Project Activity Plots Geography of Use Team members The purpose of this umbrella project is to provide a central repository of user-contributed OpenSim motion and simulation data. This collection is no longer being maintained through this project. To find OpenSim motion and simulation data, you can conduct a search on SimTK. Go to https://simtk.org/search/search.php?srch=neuromuscular&type_of_search=soft and then narrow your search to \"data sets\" by checking the box on the left. ---------------------------------- A repository of motion data from experiments and simulations, contributed by members of the OpenSim community. Please respect your fellow OpenSim Users. In using these data we ask that you respect the hard work of your fellow researchers by citing their work appropriately. When you go to the Download section you will be directed to individual project pages for each model which contain all of the files and documentation. Please carefully review the publications and cite the references in your future papers, presentations, grant applications, etc. Have data to contribute? Do you have simulation or motion data which you would like to make available through this library? Providing others with access to your data can stimulate future studies, provide a foundation for young researchers, and maximize the impact of your work. It’s easy to set up a project page to post your work. This will allow you to track who is using your data and be in contact with them. Please consider contributing! If you would like to have your project included on this site, please contact Jennifer Hicks, listed as one of the Project Leads. No guarantees about quality, correctness or support are provided by the SimTK team or OpenSim team. Use at your own risk. To find out more about the OpenSim project, please visit http://opensim.stanford.edu . 12 followers Last updated May 4, 2016 Project Statistics Jennifer Hicks People also viewed Dynamic Simulation of Movement\r\nBased on OpenSim and... Platform for Dynamic Simulation and Control of... Marker registration method informed by anatomical... Batch OpenSim Processing Scripts (BOPS) OpenSim Simulations Library Simple Dynamic Arm Model with Muscles Matlab parallel Opensim state derivative... UW Simulation Tools See all OpenSim Utilities Muscle-actuated Simulation of Human Running Calibrated EMG-Informed Neuromusculoskeletal... Muscle contributions to mass center... Simbody: Multibody Physics API OpenSim plugin to extract the muscle lines of action Neuromusculoskeletal Modeling (NMSM) Pipeline SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
  "extracted_date": "2025-03-29 22:19:40"
}