{
  "id": "doc_72",
  "url": "https://simtk.org/projects/modelerskitchen",
  "title": "SimTK: The Musculoskeletal Modeler's Kitchen: Project Home",
  "content_type": "reference",
  "category": "general",
  "hierarchy": [
    "projects",
    "modelerskitchen"
  ],
  "difficulty": "intermediate",
  "raw_text": "The Musculoskeletal Modeler's Kitchen Share Follow Project Follow publicly Follow privately Unfollow See followers (11) List Map More info 559 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Wiki Source Code Summary Browse source code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Wiki Source Code Summary Browse source code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow Provide a space for people developing and using musculoskeletal models to collaborate and learn from each other. Download Latest Releases modelerskitchen: CMakeLists_OS22_VS9.txt modelerskitchen: CMakeLists_OS24_VS10.txt OpenSim API Programs: CMakeLists.txt OpenSim API Programs: musclestrengthscaler.zip Plots to Share: MaxOutExampleTA.tif Tools in Other Programs: BatchOpenSimInMatlab.zip Tools in Other Programs: mslFileAutomation.zip Making musculoskeletal models and simulations is a lot like cooking.  Anything complicated is going to take a while to get just right and there will probably be a few failed attempts along the way.  Unfortunately, in research we only see the tasty, beautifully presented, dish served at the fancy party (the paper in a journal) and not the burnt, over-salted, misshapen disasters that preceded it (all those failed simulations and ideas that didn't pan out).  But there's a lot of great stuff in those failed attempts and we should document it somewhere. Did you spend 2 weeks debugging something that was fixed with one line of code?  Share it! Do you have a simulation that you need help with? Ask for help here! Did someone give you a great time saving tip?  Pass it on! Did you make something cool but unpublishable?  Brag about it! Have strong opinions about modeling and simulation? Climb on that soapbox! Fail proudly. 1,578 downloads 38 forum posts 11 followers Last updated Mar 17, 2025 Project Statistics Join Mailing Lists Suggest Idea Edith Arnold jimmy d Downloads Anything goes. Most stuff will happen in the Wiki and  Forum. GO TO ADVANCED>PUBLIC FORUMS. Contact the Project Lead to get Read/Write permissions to add stuff. See all Downloads Related Projects The project owner recommends the following other projects: OpenSim Neuromuscular Models Library Lower Limb Model 2010 Matlab-Opensim Interfaces People also viewed Convert .c3d and .csv files to OpenSim files... Muscle-actuated Simulation of Human Running Platform for Dynamic Simulation and Control of... London Lower Limb Model Muscle contributions to mass center... Simbody: Multibody Physics API EMG-informed Computed Muscle Control for Dynamic... OpenSim plugin to extract the muscle lines of action See all Calibrated EMG-Informed Neuromusculoskeletal... ForceBalance : Systematic Force Field Optimization Whole-Cell Computational Model of Mycoplasma... How much muscle strength is required to walk in... OpenSim Motion and Simulation Data Open Knee(s): Virtual Biomechanical... Drop Landing Model SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
  "extracted_date": "2025-03-29 22:19:49"
}