{
  "id": "doc_70",
  "url": "https://simtk.org/projects/c3dtoolbox",
  "title": "SimTK: C3D Extraction Toolbox: Project Home",
  "content_type": "reference",
  "category": "general",
  "hierarchy": [
    "projects",
    "c3dtoolbox"
  ],
  "difficulty": "intermediate",
  "raw_text": "C3D Extraction Toolbox Share Follow Project Follow publicly Follow privately Unfollow See followers (12) List Map More info 341 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Team members Downloads Forums Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Team members Downloads Forums Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow Provide a simple and time efficient way to extract raw gait data from a C3D file Download Latest Releases GaitExtractToolbox: GaitExtractToolbox171.zip License: GaitExtractToolbox This toolbox is of benefit to musculoskeletal modellers in the field of biomechanics / bioengineering to assist extracting kinematic, kinetic, and EMG information directly from a C3D file for Matlab manipulation or for input to OpenSim biosimulation software. The scripts can be configured for any laboratory configuration. This software is free without warranty but I do ask for acknowledgement if used in publications. Free download is available with documentation and two examples included. Main features of this script include: Custom markerset extraction Foot-plate detection algorithm Kinetic extraction (ground reaction forces / moments) Center of pressure calculation Transformation to customizable model coordinate system Custom EMG acquisition & processing tools XML file production (for OpenSim) Lab customizable The scripts require Motion Labs C3D Server software (freeware) and XML Toolbox (Marc Molinari)(freeware) which is included with the script download. Also requires Matlab 2008 or greater (32 bit only) with the Signal Processing Toolbox. Additional C3D software may be useful and these are available at http://www.c3d.org/c3dapps.html . Review the included manual for version updates and additions. Please inform me of bugs / suggestions to improve as this will be an ongoing project. 6,689 downloads 45 forum posts 12 followers Last updated Jul 12, 2012 Project Statistics Suggest Idea Tim Dorn Related Projects The project owner recommends the following other projects: Tim's OpenSim Utilities Muscle function of overground running across a range of speeds People also viewed C3D Extraction Toolbox GUI Full Body Model for use in Dynamic Simulations of... Matlab MOtion data elaboration TOolbox for... Cal Poly Human Motion Biomechanics Lab Knee Joint... STO / TRC / MOT files plotter Neuromusculoskeletal Modeling (NMSM) Pipeline OpenSim Utilities Lee-Son's Toolbox: a Toolbox that Converts VICON... See all OpenSim Motion and Simulation Data OpenSIM users group: University of Delaware A Visualization Tool for OpenSim Platform for Dynamic Simulation and Control of... Tim's OpenSim Utilities OpenSim Utilities for Gait and Movement Analysis Dynamic Simulation of Movement\r\nBased on OpenSim and... SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
  "extracted_date": "2025-03-29 22:19:43"
}