{
  "id": "doc_71",
  "url": "https://simtk.org/projects/vphop",
  "title": "SimTK: The Osteoporotic Virtual Physiological Human: Project Home",
  "content_type": "reference",
  "category": "general",
  "hierarchy": [
    "projects",
    "vphop"
  ],
  "difficulty": "intermediate",
  "raw_text": "The Osteoporotic Virtual Physiological Human Share Follow Project Follow publicly Follow privately Unfollow See followers (3) List Map More info 488 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Summary Browse source code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Summary Browse source code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News VPHOP project will develop, validate and deploy the next generation of technology to predict the risk of fracture in patients with low bone mass, enabling clinicians to provide better prognoses and implement more effective treatment strategies. Nearly four million osteoporotic bone fractures cost the European health system more than 30 billion Euro per year. This figure could double by 2050. After the first fracture, the chances of having another one increase by 86%. We need to prevent osteoporotic fractures. The first step is an accurate prediction of the patient-specific risk of fracture that considers not only the skeletal determinants but also the neuromuscular condition. The aim of VPHOP is to develop a multiscale modelling technology based on conventional diagnostic imaging methods that makes it possible, in a clinical setting, to predict for each patient the strength of his/her bones, how this strength is likely to change over time, and the probability that the he/she will overload his/her bones during daily life. With these three predictions, the evaluation of the absolute risk of bone fracture will be much more accurate than any prediction based on external and indirect determinants, as it is current clinical practice. These predictions will be used to: i) improve the diagnostic accuracy of the current clinical standards; ii) to provide the basis for an evidence-based prognosis with respect to the natural evolution of the disease, to pharmacological treatments, and/or to preventive interventional treatments aimed to selectively strengthen particularly weak regions of the skeleton. For patients at high risk of fracture, and for which the pharmacological treatment appears insufficient, the VPHOP system will also assist the interventional radiologist in planning the augmentation procedure. The various modelling technologies developed during the project will be validated not only in vitro, on animal models, or against retrospective clinical outcomes, but will also be assessed in term of clinical impact and safety on small cohorts of patients enrolled at four different clinical institutions, providing the factual basis for effective clinical and industrial exploitations. 0 downloads 3 forum posts 3 followers Last updated May 6, 2015 Project Statistics Join Mailing Lists Suggest Idea Marco Viceconti Martina Contin Matteo Balestri Debora Testi Giordano Valente Saulo Martelli News NMSBuilder free seminar Apr 17, 2013 NMSBuilder is a user-friendly tool package for developing OpenSim musculoskeletal models from patient-specific biomedical data and for leveraging OpenSim to perform dynamic simulations of movement. NMSBuilder: musculo-skeletal modelling software beta version Apr 8, 2013 NMSBuilder is a user-friendly tool package for developing OpenSim musculoskeletal models from patient-specific biomedical data and for leveraging OpenSim to perform dynamic simulations of movement. Webinar on the NMSBuilder Software Nov 19, 2012 On Dec 4th, 2012 Giordano Valente, from the NMS Physiome team at the Istituto Ortopedico Rizzoli will describe and demo the NMSBuilder Software to generate subject-specific models for OpenSim. NMSBuilder alpha release available! Oct 11, 2012 NMSBuilder is a user-friendly tool package for developing OpenSim musculoskeletal models from patient-specific biomedical data and for leveraging OpenSim to perform dynamic simulations of movement. VPHOP Scientific Publications has reached 116! Apr 14, 2012 At the end of the 3rd Year of the project, the number of Scientific Publications published by the VPHOP Consortium is now more than 100. Empirica Webinar on Assessing Clinical and Economic Benefits Mar 31, 2012 In March, Empirica researchers Dr. Karl Stroetmann and Dr. Rainer Thiel presented a webinar on the validation of Virtual Physiological Human (VPH) simulation models and the assessment of their potential clinical and socio-economic impact on both society and individual stakeholders like clinicians. VPHOP hits 1 millions computation hours on PLX! Mar 22, 2012 In the last year, the VPHOP partners have performed a huge number of simulations on the PLX system hosted at CINECA. VPHOP at ORS 2012 and ECR 2012: great success! Mar 17, 2012 The last month was very busy for the VPHOP Consortium. The first version of the final Hypermodel run successfully Feb 9, 2012 The first version of the Hypermodel of the femoral region, originally due for PM38, but postponed to PM42, was successfully built integrating all five sub-models operating at different dimensional scales and successfully run on PLX platform. VPHOP: The 3rd Year Outcome Report by the EC Reviewers Jan 22, 2012 The outcome of the third review meeting held in Bologna on 16th-17th January has been presented in a consolidated review report received by the PMO at the beginning of February. VPHOP 3rd Review Meeting: green light from the EC reviewers Jan 18, 2012 The third Review Meeting was held in Bologna last 16th-17th of January in front of the EC project officer Joel Bacquet and four peer scientists EC reviewers. 3rd VPH study group on VPH Toolkit Dec 4, 2011 The third VPH NoE study group (SG3) will be held in Barcelona in May 2012. VPHOP abstract accepted for presentation at ECR2012 Imagine Nov 3, 2011 The abstract “Image-based, personalised and multiscale modelling to predict the risk of fracture in osteoporotic patients: the VPHOP integrated project” was one of the 18th selected (from a total of 85 submitted abstracts!) to participate to the “Novel technology that shapes Radiology: EIBIR presents IMAGINE” workshop which will be held during the ECR 2012 in Vienna. VPHOP 3rd Annual Consortium Meeting Oct 14, 2011 Thanks to the kind offer of Keita Ito, WP6 leader, the 3rd Annual Consortium Meeting will be hosted by the Technische Universiteit Eindhoven - TU/e. In Vitro Experiments completed at IOR for Augmentation Model Aug 30, 2011 Together with the University of Bern, in vitro experiments were completed at the Istituto Ortopedico Rizzoli to provide validation data for the interventional treatment planning modules. VPHOP towards end-user applications Jul 2, 2011 The PMO has recently submitted to the EC Project Officer a non-contractual document named \"D1.101 Use cases and architectural paradigm\". A new GPU powered system in CINECA (upgrade of PLX) Jun 22, 2011 CINECA and SCS are announcing a very important upgrade of PLX system which reaches now a peak performance near to 300 TFlops, making it the most powerful Supercomputer in Italy. Statistical modeling of human femurs successfully tested May 10, 2011 The development and validation of algorithms for statistical modeling of shape and mineral density (BMD) of human femurs have now been completed with good results! EOS imaging: the clinical study is ready to start Apr 30, 2011 On the 23rd of March in Paris it was held an important meeting for the VPHOP project which saw the partecipation of representatives of Arts Association (LBM), EOS imaging (BSP), Institut National de la Santé et de la Recherche Médicale (INS) and Istituto Ortopedico Rizzoli (IOR). Actibelt technology offers activity profile of patients Apr 15, 2011 Another deliverable of the VPHOP Project has been completed. Fast FE-solver for nonlinear analyses Mar 30, 2011 On the 21st of January 2011 the deliverable 6.2 of the VPHOP project has been completed. VPHOP: a summary of the activities of the second year Feb 11, 2011 At the end of the second year of its activities, the Osteoporotic Virtual Physiological Human –VPHOP- research project has made crucial steps upfront for the achievement of the project’s objectives. University of Geneve starts patients enrollment Nov 3, 2010 The University of Geneve, in collaboration with the NeuroZentrum Zurich, has recently started a VPHOP clinical pre-trial with 30 patients which serves to validate a set of software tools the University of Bern has developed. PhysiomeSpace: complete female 3D human skeleton model Jun 28, 2010 Super Computing Solutions –SCS- and the Computational Bioengineering Lab –BIC- by the Istituto Ortopedico Rizzoli are happy to announce the release of the first dataset that composes the Living Human Digital Library –LHDL- multiscale musculoskeletal data collection. PhysiomeSpace: share biomedical data in a free and easy way! Jun 28, 2010 B3C today announces the release of an interactive digital library service, called PhysiomeSpace, designed to manage and share a large collection of heterogeneous biomedical data, such as medical imaging, motion capture, biomedical instrumentation signals, finite element models, etc. VPHOP gets coverage on Biomedical Computation Review Jun 23, 2010 The summer issue of Biomedical Computation Review, a quarterly journal published by the national Center for Biomedical Computing at Stanford, covers the topic of physiome research. The  European Virtual Physiological Human Institute Apr 27, 2010 To provide strong support for both the European Union Virtual Physiological Human (VPH) research initiative and the global “Physiome” community, the process to establish a European VPH Institute has now officially started. NMS Physiome started on January 2010 Mar 25, 2010 An international collaboration for musculoskeletal predictive medicine, called Neuro-Musculo-Skeletal Physiome or NMS Physiome for short, officially started on January 27th, 2010. See all News People also viewed OpenMM Zephyr SimTK Website Whole-Cell Computational Model of Mycoplasma... LAPACK linear algebra library (with BLAS) DireX - Conformational Sampling under Low... NAST (The Nucleic Acid Simulation Tool) Stiffness Modulation of Redundant... MemtestG80 and MemtestCL: Memory Testers for CUDA-... See all ForceBalance : Systematic Force Field Optimization Open Knee(s): Virtual Biomechanical... MSMBuilder Simulations of Crouch Gait Data-driven prediction of gait with ankle... Spasticity model in OpenSim ＯｐｅｎＳｉｍＣｏｌａｂ (OpenSim in Google Colab) SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
  "extracted_date": "2025-03-29 22:19:46"
}