{
  "id": "doc_11",
  "url": "https://simtk.org/category/category.php?cat=420&sort=date&page=0&srch=&",
  "title": "SimTK: Project category",
  "content_type": "reference",
  "category": "general",
  "hierarchy": [
    "category",
    "category.php"
  ],
  "difficulty": "intermediate",
  "raw_text": "Tissue Computational methods provide new insights on how and why tissues degenerate and how they can be repaired and regenerated, impacting a diverse range of conditions including osteoarthritis, corneal disease, and skin wounds. Featured projects Recently updated projects total projects 24 projects with downloads Search projects in this category News OpenArm Multisensor data set and muscle contour tracking code released + slated for presentation at ASB & BioRob! OpenArm: Volumetric & Time Series Models of Muscle Deformation Jul 24, 2020 OpenArm 2.0 data set released + scheduled for presentation at EMBC Berlin! OpenArm: Volumetric & Time Series Models of Muscle Deformation Jul 16, 2019 First OpenArm 3D muscle deformation data set released! OpenArm: Volumetric & Time Series Models of Muscle Deformation Nov 29, 2018 Publications Open Knee(s): A Free and Open Source Library of Specimen-Specific Models and Related Digital Assets for Finite Element Analysis of the Knee Joint, Snehal Chokhandre, Ariel Schwartz, Ellen Klonowski, Benjamin Landis & Ahmet Erdemir, Annals of Biomedical Engineering volume 51, pages10–23 (2023) Laura Hallock, Akira Kato, and Ruzena Bajcsy. \"Empirical quantification and modeling of muscle deformation: Toward ultrasound-driven assistive device control.\" In IEEE International Conference on Robotics and Automation (ICRA). IEEE, 2018. \"Competing Mechanistic Hypotheses of Acetaminophen-Induced Hepatotoxicity Challenged by Virtual Experiments\" Andrew K. Smith, Brenden K. Petersen, Glen E. P. Ropella, Ryan C. Kennedy,\r\nNeil Kaplowitz, Murad Ookhtens, C. Anthony Hunt. PLoS Comput Biol. 2016 Dec 16;12(12):e1005253 Discussion Does OpenSim account for joint friction? Open Knee: A Three-Dimensional Finite Element Representation of the Knee Joint Feb 14, 2025 Does OpenSim account for joint friction? Grand Challenge Competition to Predict In Vivo Knee Loads Feb 14, 2025 Synchronized c3d-data 6th competition Grand Challenge Competition to Predict In Vivo Knee Loads Mar 19, 2024 SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
  "extracted_date": "2025-03-29 22:15:55"
}