{
  "id": "doc_53",
  "url": "https://simtk.org/tracker/?atid=2089&group_id=91&func=browse",
  "title": "SimTK: OpenSim: Suggested Ideas",
  "content_type": "reference",
  "category": "general",
  "hierarchy": [
    "tracker"
  ],
  "difficulty": "intermediate",
  "raw_text": "OpenSim Share Follow Project Follow publicly Follow privately Unfollow See followers (313) List Map More info 91 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Source Code Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News Trackers Displaying results 1‒22 out of 22 total. Displaying 10 25 50 100 1000 results. Submit new issue Advanced queries Simple Filtering and Sorting Build Query Assignee: Unassigned Joy Ku Ayman Habib Ajay Seth Jennifer Hicks Scott Delp Thomas Uchida Diane Bush Jacqueline Tran Carmichael Ong Matt Petrucci Nicholas Bianco Matt DeMers Shrinidhi KL Michael Sherman Apoorva Rajagopal Paul Mitiguy Chand John Katherine Steele Lorenzo Flores Simtk Builder Daniel Jacobs Soha Pouya Any State: Any Open Closed Deleted Order by: Id Priority Summary Open Date Last Modified Date Close Date Submitter Assignee # Votes # Voters % Votes Ascending Descending Id Summary Open Date Assigned to Submitted by 2474 Difference between Opensim and Anybody software * 2016-12-23 06:24 Nobody Gunjan Patel 2488 Extra time control for Analyze while using analyze tool from Matlab. * 2017-02-03 05:52 Nobody Hari S 2506 How to put parts built with other software * 2017-03-13 08:46 Nobody cui weiling 2507 How to put parts built with other software into opensim * 2017-03-13 08:49 Nobody cui weiling 2537 RRA adjusted segment weights * 2017-05-07 23:25 Nobody Michael Samaan 2713 oursainsburys * 2018-12-06 13:37 Nobody our sainsbur 2714 mycoles * 2018-12-06 13:38 Nobody our sainsbur 2715 mandspeoplesystem * 2018-12-06 13:38 Nobody our sainsbur 2716 mynordstrom * 2018-12-06 13:39 Nobody our sainsbur 2717 mymorri * 2018-12-06 13:39 Nobody our sainsbur 2735 32-bit version * 2019-02-06 21:28 Nobody Elroy Sullivan, PhD 2814 suggestion * 2019-05-28 05:23 Nobody alireza Faghihi 2831 How to download xml files all * 2019-06-19 09:30 Nobody RAHUL GHARATE 2894 Data Normalization * 2020-02-17 07:43 Nobody Mohammadreza Rezaie 2941 IAA configuration in GUI * 2020-04-10 16:24 Nobody Mohammadreza Rezaie 2984 OpenSim 4.1 problem * 2020-07-18 14:15 Nobody yong-siang zhang 3029 More wrapping surfaces shapes, or ability to combine them * 2020-12-19 15:34 Nobody A B 3183 Multiuser capability of Matlab Scripting Environment (Windows) * 2022-06-24 11:25 Nobody Lorenz Winkler 3240 Configuring With Matlab * 2023-08-17 15:29 Nobody Luke Sarantos 3262 Auto save API visualizations * 2023-11-16 13:51 Nobody Therese Parr 3308 Fascia Simulation + Geometry + Group Activation. * 2024-07-15 11:49 Nobody Fernando García-Avello 3313 Movesense data transform problem. * 2024-09-18 08:00 Nobody Ge Cos * Denotes requests > 45 Days Old SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
  "extracted_date": "2025-03-29 22:18:38"
}