{
  "id": "doc_99",
  "url": "https://simtk.org/projects/sb_force",
  "title": "SimTK: Tibial forces in independently ambulatory children with spina bifida: Project Home",
  "content_type": "reference",
  "category": "general",
  "hierarchy": [
    "projects",
    "sb_force"
  ],
  "difficulty": "intermediate",
  "raw_text": "Tibial forces in independently ambulatory children with spina bifida Share Follow Project Follow publicly Follow privately Unfollow See followers (0) List Map More info 2380 About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News About Project summary Project statistics Downloads Summary Project Activity Plots Geography of Use Forum Statistics Publications Team members Downloads Documents Forums Issues View trackers Bugs Bugs tracker Submit new Follow Features Features tracker Submit new Follow Suggested Ideas Suggested Ideas tracker Submit new Follow News Bone strength data, kinematic and kinetic overground walking data, and simulation results from 16 independently ambulatory children with spina bifida and 16 age- and sex-matched children with typical development. Download Latest Releases Dataset and Code: repo.zip Experimental motion capture and bone strength data and simulation results from 16 independently ambulatory children with spina bifida and 16 age- and sex-matched children with typical development. Additional motion capture and EMG data and simulation results for 6 independently ambulatory children with spina bifida and 1 child with typical development. Custom scripts were used to calculate joint kinematics, moments, and forces. Post-simulation analyses were conducted to compare these waveforms between the group with spina bifida and the group with typical development. The manuscript using these data and simulations can be found here: Lee MR, Hicks JL, Wren TAL, and Delp SL (2022). Independently ambulatory children with spina bifida experience near-typical knee and ankle joint moments and forces during walking. Gait and Posture, 99:1-8. https://doi.org/10.1016/j.gaitpost.2022.10.010 64 downloads 1 forum posts Last updated Oct 24, 2022 Project Statistics Suggest Idea Marissa Lee Sinopoli Tishya Wren Jennifer Hicks Scott Delp News File updated: repo.zip Oct 24, 2022 We updated our analyses with our paper revision!. Code and analyses have been updated. See all News People also viewed JointReaction: OpenSim joint load analysis plugin Spasticity model in OpenSim A three-dimensional musculoskeletal model of the dog Evertor and invertor muscle co-activation... Muscle contributions to mass center... Multidimensional Cubic B-Spline Examining Muscle Forces during Sit to Stand Transfer... SPAN: Simulated parallel annealing by neighborhood See all Analysis of arm swing during human walking OpenSim OpenSim Moco Enhanced Model Assembly for Intervertebral... Human Posture and Balance Platform in OpenSim Sensory Components for Simulating Postural Feedback... Sky Higher: Dynamic Optimization of Maximum Jump Height... SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
  "extracted_date": "2025-03-29 22:21:05"
}