{
  "id": "doc_4",
  "url": "https://simtk.org/",
  "title": "SimTK: Welcome",
  "content_type": "reference",
  "category": "general",
  "hierarchy": [
    "Root"
  ],
  "difficulty": "intermediate",
  "raw_text": "Enabling groundbreaking biomedical research via open access to high-quality\n                    simulation tools, accurate models, and the people behind them. 1914 projects 4312297 downloads 162849 members Join Us OpenMM An open-source toolkit for molecular simulation with extreme flexibility through custom forces and integrators and extreme performance through GPU acceleration... Learn more Mycoplasma genitalium Whole-Cell Model A detailed computational model of the entire life cycle of the bacterium Mycoplasma genitalium ... Learn more OpenSim State-of-the-art modeling and simulation software for advancing our understanding of movement and designing improved treatments for movement abnormalities... Learn more SimVascular Providing a complete pipeline for patient-specific modeling from medical image data to cardiovascular blood flow simulation and analysis... Learn more FEATURE Modeling and finding functional domains in proteins by analyzing the structures of functionally similar proteins using supervised machine learning algorithms... Learn more Previous Next Trending Projects Thoracolumbar spine and rib cage model in OpenSim The aim of this project is to provide detailed and well-validated musculoskeletal models of the thoracolumbar spine and rib cage, particularly for investigators with an interest studying musculoskeletal loading in the trunk. Total followers: 39 OpenSim Provide easy-to-use, extensible software for modeling, simulating, controlling, and analyzing the neuromusculoskeletal system. Downloads last week: 1,946 Forum posts last week: 13 Total followers: 319 New followers: 1 Total downloads: 836,655 Simulations of Crouch Gait Simulations of individuals with cerebral palsy who walk in a crouch gait . These simulations were used in analyses of (1) contributions to mass center accelerations, (2) impacts of muscle weakness, (3) magnitudes of tibiofemoral contact forces, and (4) evaluations of ankle foot orthoses during crouch gait. Downloads provide all supporting files for OpenSim simulations. Please see accompanying publications for more information. Downloads last week: 73 Total downloads: 15,099 Open Knee(s): Virtual Biomechanical Representations of the Knee Joint Open Knee(s) goals have been to provide free access to three-dimensional finite element representations of the knee joint and promote open development of knee models for collaborative testing and use. \r\n\r\n<B>Definitive Guide to Project and Its Outcomes</B> Open Knee(s): A Free and Open Source Library of Specimen-Specific Models and Related Digital Assets for Finite Element Analysis of the Knee Joint. Chokhandre S, Schwartz A, Klonowski E, Landis B, Erdemir A. Ann Biomed Eng. 2023 Jan;51(1):10-23. (<A HREF=\"https://doi.org/10.1007/s10439-022-0307 4-0\">https://doi.org/10.1007/s10439-022-03 074-0</A>)\r\n\r\n<B>Definitive Guide to Open Knee(s) Data</B> Specimen specific imaging and joint mechanical testing data for next generation virtual knees. Chokhandre S, Neumann EE, Nagle TF, Colbrunn RW, Flask CA, Colak C, Halloran J, Erdemir A. Data Brief. 2021 Jan 30;35:106824. (<A HREF=\"https://doi.org/10.1016/j.dib.2021.1068 24\">https://doi.org/10.1016/j.dib.2021.106 824</A>)\r\n\r\n<B>Database of Open Knee(s) Models</B> Under Downloads -> Data Share -> View -> OKS_models and at (<A HREF=\"https://doi.org/10.18735/b0zv-n395\" ;>https://doi.org/10.18735/b0zv-n395</A>) <B>Database of Open Knee(s) Data</B> Growing version under Downloads -> Data Share -> View -> Open Knees Data; permanent static version at (<A HREF=\"https://doi.org/10.18735/4e78-1311\" ;>https://doi.org/10.18735/4e78-1311</A>) Downloads last week: 223 Total followers: 47 Total downloads: 151,574 Reproducibility in simulation­-based prediction of natural knee mechanics This project aims for understanding the influence of modelers’ approaches and decisions (essentially their art) throughout the lifecycle of modeling and simulation. It will demonstrate the uncertainty of delivering consistent simulation predictions when the founding data to feed into models remain the same. The project site also aims to be a hub to provide an overview of resources for modeling & simulation of the knee joint. Funding is provided by the National Institute of Biomedical Imaging and Bioengineering, National Institutes of Health (Grant No. R01EB024573). Downloads last week: 165 Total downloads: 29,083 Upper Extremity Dynamic Model Provides the files associated with a dynamic model of the upper limb for use in SIMM or OpenSim. Total followers: 45 OpenCap OpenCap is a software package to estimate 3D human movement dynamics from smartphone videos. Forum posts last week: 13 OpenMM Zephyr OpenMM Zephyr provides a visual application for running GPU-accelerated molecular simulations. Downloads last week: 12,755 Total downloads: 1,248,055 Upper Extremity Kinematic Model Upper-extremity available for download along with accompanying publications. Total followers: 27 Total downloads: 11,355 OpenSim Moco OpenSim Moco solves optimal control problems with musculoskeletal models defined in OpenSim, using direct collocation. Forum posts last week: 5 SimVascular: Cardiovascular Modeling and Simulation Provides a platform for patient-specific cardiovascular modeling and simulation. Downloads last week: 137 Forum posts last week: 7 Total followers: 80 Total downloads: 52,046 Calibrated EMG-Informed Neuromusculoskeletal Modelling Toolbox (CEINMS) Provides an easy to use toolbox, compatible with OpenSim, for the estimation of the human lower extremity muscle and joint dynamics. Downloads last week: 75 Total followers: 41 Platform for Dynamic Simulation and Control of Movement based on OpenSim&MATLAB This project overcomes neuromusculoskeletal systems limitations of MATLAB®/Simulink® and robust design & control limitations of OpenSim through an interface between these two software packages that combines relevant strengths of each individual package. Total followers: 75 New followers: 1 SCONE: Open Source Software for Predictive Simulation SCONE is free and open-source software for <b>predictive simulation</b> of human and animal motion. Please visit the <a href=\"https://scone.software\">SCONE homepage</a> for more information, or <a href=\"https://simtk.org/frs/?group_id=1180&qu ot;>download SCONE</a> for <b>Windows</b>, <b>Linux</b> and <b>macOS</b>. Forum posts last week: 2 Total followers: 35 OpenRobotRehab: Data Sets & Platforms for Robot-Mediated Rehabilitation The OpenRobotRehab data sets and open-source software platforms are designed to enable study of human neuromechanical behavior when modified by rehabilitative robots.\r\n\r\n**NEW:** The OpenRobotRehab 1.0 release contains time-series data from 13 healthy and 2 post-stroke participants performing isometric upper-limb rehabilitation gaming tasks, including raw and processed surface electromyography (sEMG), force torque, and game performance data, alongside analysis code and protocol details. New download files: 2 By Category Biological applications Cardiovascular system Cell Myosin Neuromuscular system Protein RNA Tissue Biocomputational focus Experimental analysis Image processing Network modeling and analysis Physics-based simulation Statistical analysis Visualization Communities OpenSim Shoulder Modeling SimVascular IMAG/MSM Consortium IMAG-MSM Public Dissemination & Education Working Group Biomechanics of Movement See all communities... Jobs See all job openings... News New Calibrated Knee Models and Dataset Validation of Subject-Specific Knee Models from In Vivo Measurements Mar 20, 2025 A new link, Knee Model and Optimization Software, has been added to release Initial Dataset Publication of S193761 Model. OpenSim Creator 0.5.21 is now available 🥳 OpenSim Creator Mar 3, 2025 It's a minor release that makes the installer ~5 MB smaller, adds support for HighDPI 3D rendering. SimTK is maintained through Grant R01GM124443 01A1 from the National Institutes of Health (NIH). It was initially developed as part of the Simbios project funded by the NIH as part of the NIH Roadmap for Medical Research, Grant U54 GM072970. Our Pledge and Your Responsibility Feedback About Join Version 4.2.2. Website design by Viewfarm . Icons created by SimTK team using art by GraphBerry from www.flaticon.com under a CC BY 3.0 license. Forked from FusionForge 6.0.5. #FDF8E1 @light_yellow #F75236 @red #F5B563 @orange #81A5D4 @light_blue #5E96E1 @dark_blue #505050 @dark_grey #000000 @black #A7A7A7 @light_grey Feedback",
  "extracted_date": "2025-03-29 22:15:35"
}